grevaillot/svd_tools/headers/ATSAM4SP32A/memorymap.h
#pragma once 

#define SSC_BASE			(0x40004000)
#define PPLC_BASE			(0x40008000)
#define TC0_BASE			(0x40010000)
#define TC1_BASE			(0x40014000)
#define TWI0_BASE			(0x40018000)
#define TWI1_BASE			(0x4001c000)
#define PWM_BASE			(0x40020000)
#define USART0_BASE			(0x40024000)
#define USART1_BASE			(0x40028000)
#define UDP_BASE			(0x40034000)
#define ADC_BASE			(0x40038000)
#define DACC_BASE			(0x4003c000)
#define ACC_BASE			(0x40040000)
#define CRCCU_BASE			(0x40044000)
#define CMCC_BASE			(0x4007c000)
#define MATRIX_BASE			(0x400e0200)
#define PMC_BASE			(0x400e0400)
#define UART0_BASE			(0x400e0600)
#define CHIPID_BASE			(0x400e0740)
#define UART1_BASE			(0x400e0800)
#define EFC0_BASE			(0x400e0a00)
#define EFC1_BASE			(0x400e0c00)
#define PIOA_BASE			(0x400e0e00)
#define PIOB_BASE			(0x400e1000)
#define PIOC_BASE			(0x400e1200)
#define RSTC_BASE			(0x400e1400)
#define SUPC_BASE			(0x400e1410)
#define RTT_BASE			(0x400e1430)
#define WDT_BASE			(0x400e1450)
#define RTC_BASE			(0x400e1460)
#define GPBR_BASE			(0x400e1490)
